// Задача 3: Задайте массив из вещественных чисел с
// ненулевой дробной частью. Найдите разницу между
// максимальным и минимальным элементов массива. 
// массив [2.2 0.4 9.11 7.2 78.98] => 78.58
// массив [1.22 4.5 3.33] => 3.28

double[] arr = {0.25, 5.4, 1.3, 2.1, 3.8, 5.2, 3.01};
// double[] arr = {2.2, 0.4, 9.11, 7.2, 78.98};
// double[] arr = {1.22, 4.5, 3.33};

double max = -1;
double min = 99999;

for (int i = 0; i < arr.Length; i++)
{
    if (arr[i] > max)
    {
        max = arr[i];
    }
    if (arr[i] < min)
    {
        min = arr[i];
    }
}
Console.WriteLine(max-min);